package katas.day01;

public class Box {
    public static void main(String[] args) {
//        В классе Box создать метод, который принимает в качестве параметра объект box,
//    и возвращает новую коробку, у которой все размеры равны: размеры вызывающего объекта + размеры переданного объекта.
//
//    Создать конструктор, который принимает 2 коробки. С помощью этого конструктора можно будет создать объект,
//    который по объему больше, чем 2 переданные коробки вместе взятые.
//
//    Продемонстрировать работу метода и конструктора в классе Main в методе main().

        int box (Box) {

        }
    }
}
